[
  {
    "jobTitle": "Business Development (Fresher)",
    "providingCompany": "KPL Tech Solution Pvt Ltd - Noida, Uttar Pradesh",
    "jobDescription": "Job description:\\*Identifying sales leads.\\*Generating business by selling IT services like SEO/SMO/PPC/Websitedevelopment/Mobile applications).\\*Pitching IT services (Digital Marketing/SEO/SMO/Website development/Mobileapplications).\\*Researching organizations and individuals online to identify new leads andpotential markets.\\*Contacting clients to understand their needs.\\*Developing quotes and proposals.\\*Negotiating and renegotiating by phone & email.\\*Have to work on sales and follow up.\\*Give presentations about company services to clients.\\*Establish a good relationship with prospective clients, closures of sales for revenuegeneration.\\*Generate contact details of potential clients.\\*Generating business by selling IT services like SEO/SMO/PPC/Websitedevelopment/Mobile applications).\\*Meet and exceed monthly and quarterly revenue targets.Job Types: Full-time, Regular / Permanent, FresherSalary: ₹20,000.00 - ₹25,000.00 per monthSchedule:Monday to FridayNight shiftSupplemental pay types:Performance bonusYearly bonusAbility to commute/relocate:Noida, Uttar Pradesh: Reliably commute or planning to relocate before starting work (Required)Education:Bachelor's (Required)Experience:Business development: 1 year (Preferred)total work: 1 year (Preferred)Language:English (Preferred)Expected Start Date: 12/06/2023",
    "jobDetails": "Full-time | New-Grad",
    "qualifications": [
      "Business development",
      "Bachelor's degree"
    ],
    "benefits": [],
    "contact": ""
  },
  {
    "jobTitle": "Specialist 2, Revenue Operations",
    "providingCompany": "CrowdStrike - Pune, Maharashtra",
    "jobDescription": "#WeAreCrowdStrike and our mission is to stop breaches. As a global leader in cybersecurity, our team changed the game. Since our inception, our market leading cloud-native platform has offered unparalleled protection against the most sophisticated cyberattacks. We’re looking for people with limitless passion, a relentless focus on innovation and a fanatical commitment to the customer to join us in shaping the future of cybersecurity. Consistently recognized as a top workplace, CrowdStrike is committed to cultivating an inclusive, remote-first culture that offers people the autonomy and flexibility to balance the needs of work and life while taking their career to the next level. Interested in working for a company that sets the standard and leads with integrity? Join us on a mission that matters - one team, one fight.\n\nAbout the Role:\nCrowdStrike is looking for a Specialist – Revenue Operations. This position will report to the Assistant Accounting Manager. You will be required to interact within inter/intra teams in a fast-paced environment, sometimes under pressure, remaining proactive, resourceful, and efficient, with a high level of professionalism and confidentiality. We are looking for those eager to bring in best practice processes, take on problems, and streamline processes for revenue accounting operations.\n\nJob Summary\n\nThe ideal candidate will have a solid understanding of revenue accounting principles under US GAAP, specifically, ASC 606. Candidate should also have fair understanding and experience in GL accounting workflow and accounting principles. The person should have skills and ability to analyze the data and infer trends and potential issues before coming up with solutions. In addition, the candidate must have strong working knowledge of ERP systems (NetSuite desired) as well as of the month-end close cycle relating to revenue recognition.\n\nThe candidate must have 6-8 years of relevant accounting experience working directly with the head office on consolidated accounting records in publicly traded technology companies under SOX internal controls environment (SAAS industry experience preferred). Working knowledge and experience with automation and process improvement projects. Strong communication skills are essential as this role will interact regularly with other departments within the organization.\n\nJob Responsibilities\n\nMonth-end accounting close activities including preparation of revenue and deferred revenue journal entries for the Company’s subscription revenue\n\nPerform monthly account reconciliations for balance sheet accounts for deferred revenue and other assigned accounts\n\nReview customer contracts to make sure revenue is recognized in accordance with the ASC 606 guidance\n\nAnalyze data trends while preparing monthly and quarterly fluctuation analysis for revenue and deferred revenue accounts\n\nOversee the sales order review process performed by the accounting staff\n\nPrepare high quality internal control documentation\n\nIdentify and lead various automation projects\n\nParticipate in the completion of internal and external audits, including preparation of audit schedules and support calculations\n\nAssist in periodic Standalone Selling Price (SSP) analysis as per ASC 606 guidance\n\nWork closely with other teams within the Quote-to-Cash cycle to ensure approved revenue policies are adhered to and monitored\n\nAssisting the accounting department with the preparation of financial reports\n\nShould have an eye to the detail to question the current processes and work towards automating processes and bringing efficiencies\n\nShould be a team player and drive best out of the team members\n\nJob Qualifications\n\nAny graduation/post graduation, CA preferred\n\nHigh-tech publicly traded company experience related to revenue recognition accounting; under SOX internal control environment required and SaaS industry experience preferred\n\nExtensive working knowledge of ASC 606 required\n\nIn-depth understanding of GL accounting operations\n\nExperience with NetSuite (including their ARM modules) or another similar ERP system strongly desired\n\nExperience with other data analysis applications (e.g., Smartsheets, DOMO, MS Office at medium to expert level, Google applications, etc.)\n\nA natural go-getter attitude, data-driven, detail oriented, hands on, having a sense of urgency and the ability to follow through and implement process improvements\n\nShift Time: 2.00 PM - 11.00 PM\n\n#LI - AP-2\n\nBenefits of Working at CrowdStrike:\nRemote-first culture\n\nMarket leader in compensation and equity awards with option to participate in ESPP in eligible countries\n\nCompetitive vacation and flexible working arrangements\n\nPhysical and mental wellness programs\n\nPaid parental leave, including adoption\n\nA variety of professional development and mentorship opportunities\n\nAccess to CrowdStrike University, LinkedIn Learning and Jhanna\n\nOffices with stocked kitchens when you need to fuel innovation and collaboration\n\nBirthday time-off in your local country\n\nWork with people who are passionate in our mission and Great Place to Work certified across Asia Pacific\n\nWe are committed to fostering a culture of belonging where everyone feels seen, heard, valued for who they are and empowered to succeed. Our approach to cultivating a diverse, equitable, and inclusive culture is rooted in listening, learning and collective action. By embracing the diversity of our people, we achieve our best work and fuel innovation - generating the best possible outcomes for our customers and the communities they serve.\n\nCrowdStrike is committed to maintaining an environment of Equal Opportunity and Affirmative Action. If you need reasonable accommodation to access the information provided on this website, please contact Recruiting@crowdstrike.com, for further assistance.",
    "jobDetails": "Full-time",
    "qualifications": [
      "Accounting",
      "Communication skills",
      "Account reconciliation",
      "ERP systems",
      "Data analysis skills"
    ],
    "benefits": [],
    "contact": ""
  },
  {
    "jobTitle": "Technical Lead India",
    "providingCompany": "Meetingselect - Remote",
    "jobDescription": "You have experience in IT and are looking for a (new) challenge at an international and ambitious company. This is your chance! We are looking for a Tech Lead who can join our international team!Who are we?We are an international team, representing numerous cultures and together we worktowards one goal; and that is making sure that our clients and suppliers have the best user experience on our platform!We want to meet you!If you are the m/f/x with 8-10 years of experience in a similar position and you like to take ownership, are pro-active and can work independently, then we should really meet!You love to combine the art of design with the art of programming. You do hands on tech lead and solution.You will be involved in analysing current codes and industry developments, formulate more efficient processes, solve problems and create a value driven and seamless experience for our users.You will be part of our IT team, which is based in India.Wat do you bring?You have a Bachelor/Master degree in computer programming, computer science, or a related field.You have 8-10 years of experience in a Tech Lead or comparable position, preferably in the hospitality or travel industry.You like to work pro-actively and independently in a team.You have excellent understanding of the English language, both written and spoken.You are stress resistance, independent, accurate, pro-active, you want to learn and you have a problem-solving ability.You have good communication skills.You are a real Team player and are results oriented.You have a great eye to details.You have proficient understanding of .NET core and MVC.You have srtrong understanding of server-side CSS and understanding of frameworks like Vue.JS or ReactJS, Nuxt.You are familiar with C#,.NET Core on Linux, Postgres, Docker, Kubernetes, Elasticsearch.You have experience in building microservices.You have experience working in Agile teams with Scrum.You have a strong understanding of the web development cycle and programming techniques and tools.What can you expect from us?You will be part of a dynamic and fast-growing international company.You will work in a company with an informal atmosphere.You will have a 40-hour workweek.You are eligible to vacation days.You will receive a yearly personal budget of €500 based on 40 hours.You will have the possibility to grow within the company (also to international offices).You can work remote.You will get agent discount at internal hotel chains for private trips.When, now!Tell us why you are the perfect M/F/X addition to our team. Do you have questions about the vacancy? Please contact Sara Tayar or send your CV with a short motivation letter or video directly to work@meetingselect.com with the subject \"Tech Lead India\".See you soon!Job Type: Full-timeSchedule:Day shiftExperience:IT: 8 years (Required)Work Location: Remote",
    "jobDetails": "Full-time2 days ago",
    "qualifications": [
      "React",
      "Elasticsearch",
      "Web development",
      ".NET Core",
      "CSS",
      "Bachelor's degree",
      "Master's degree"
    ],
    "benefits": [],
    "contact": ""
  },
  {
    "jobTitle": "Project Manager",
    "providingCompany": "NUKG Business Solutions - Hyderabad, Telangana",
    "jobDescription": "CURRENTLY TECH TEAM LEADS (on projects requiring SQL) ASPIRING TO GROW IN TO PROJECT & PEOPLE MANAGEMENT ROLES WHILE ALSO BECOMING DOMAIN EXPERTS WILL BE MOST PREFERRED.Had to put the above line in ALL CAPS and bold as we have been receiving resumes from candidates with totally unrelated experience - ranging from retail sales managers to construction / maintenance engineers to administrative staff in academic institutions.Preferred Background:Overall experience minimum of 8 years in IT Services companiesCurrently in Tech Team Lead role looking for career growth that includes people management responsibilitiesExperience preferably in US Health & Welfare Insurance domain will be a plus but not essential.Program / Multiple projects management experience.Strong exposure to Agile methodology.Experience in people management of teams having a team size greater than 10Must demonstrate strong leadership skills.Very strong analytical and problem-solving skills.Proven track record of managing and ensuring deliverables within agreed timelines and budgets.This role at NUKG will lead all aspects related to:People management & stakeholder management within the organization and with clients' organization.Managing, delivering multiple projects for single or multiple clients as per agreed timelines, quality and budgets.Responsible for closely working with teams thru complete projects' life cycle.Proactively monitor, track multiple projects with a focus to mitigate potential risks related to timelines, resources and quality.Monitoring projects from requirements to release.Adhere to clients-processes and metrics of performance and quality parameters.Manage and drive reviews at regular or client defined intervals and track the actions till closure.Establish documentation and procedural standards for deliverable materials.Create and deliver status reports. Use of various tools like JIRA, Mantis, Project Insight etc.Client Management:Be the point of contact on all delivery related aspects with the customer.Implement the appropriate escalation model for all the projects/assignments.Work on the service delivery improvements initiatives along with respective delivery.Produce delivery status report on a weekly and monthly basis.Provide support as need be.Client vendor relationship management.Soft skills:Excellent leadership and customer service skills.Strong teamwork skills and attention to detail.Excellent written and verbal communication skillsPlan and organize team building activitiesLeading the team, managing conflict, and ensuring the team’s processes and tasks are carried out efficientlyAble to manage sensitive and confidential informationSelf-motivation and able to take responsibilityCompensation not a constraint for the right candidate.Work RemotelyNoJob Types: Full-time, Regular / PermanentSalary: From ₹75,000.00 per monthBenefits:Health insuranceInternet reimbursementPaid time offSchedule:Fixed shiftMonday to FridayNight shiftUS shiftSupplemental pay types:Quarterly bonusAbility to commute/relocate:Hyderabad, Telangana: Reliably commute or planning to relocate before starting work (Required)Education:Bachelor's (Required)Experience:of similar: 1 year (Required)",
    "jobDetails": "Full-time",
    "qualifications": [
      "Analysis skills",
      "Customer service",
      "SQL",
      "Jira",
      "Retail sales",
      "Bachelor's degree"
    ],
    "benefits": [
      "Health insurance",
      "Paid time off",
      "Internet reimbursement"
    ],
    "contact": ""
  },
  {
    "jobTitle": "Customer Service Representative",
    "providingCompany": "Tech Mahindra Business Services - Noida, Uttar Pradesh",
    "jobDescription": "Greetings From Tech Mahindra !!Tech Mahindra is hiring for International Voice Telecom Process!Any Graduate/ B.E./ B.Tech/ B.sc./ BBA / BA can apply.Company: Tech MahindraJob Type: PermanentLocation: Noida. (Work from Office)Experience- International BPO is preferred.Role: Customer Support Associate/ Senior Customer SupportSkills Required:1. Candidate should have at least an year experience in International Voice Process.2. Excellent English communication skills.3 Excellent logical reasoning.4. Candidate should be able to handle queries.5. Candidate should be flexible to work in 24\\*7 environments, comfortable to work in night shifts.6. Candidate should be comfortable working with WFO as per business requirements.Perks and BenefitsPerks and Benefits: Both side Transport facility available (pick & Drop).For more Details-Please contact( CALL OR WHATSAPP)- Japleen Singh(HR)- 8826741514Job Type: Full-timeSalary: ₹20,000.00 - ₹30,000.00 per monthBenefits:Health insuranceLife insuranceProvident FundSchedule:Evening shiftNight shiftUS shiftSupplemental pay types:Performance bonusAbility to commute/relocate:Noida, Uttar Pradesh: Reliably commute or planning to relocate before starting work (Required)Education:Higher Secondary(12th Pass) (Required)Experience:total work: 1 year (Required)Customer service into International BPO: 1 year (Required)International voice process: 1 year (Required)Language:English (Required)Hindi (Preferred)Shift availability:Night Shift (Required)Willingness to travel:100% (Required)Work Location: In person",
    "jobDetails": "Full-time2 days ago",
    "qualifications": [
      "Customer service",
      "Customer support",
      "Communication skills",
      "Business requirements",
      "B.B.A.",
      "B.Sc",
      "Bachelor's degree",
      "12th Pass"
    ],
    "benefits": [
      "Health insurance",
      "Life insurance"
    ],
    "contact": ""
  },
  {
    "jobTitle": "Data Entry Specialist",
    "providingCompany": "Bionics Enviro Tech - Chennai, Tamil Nadu",
    "jobDescription": "Job Title: Data Entry SpecialistCompany: Bionics Enviro TechLocation: ChennaiJob Type: Full-TimeAbout Us:We are a leading company in the Biological Waste Water Treatment system and We are seeking an experienced Sales Manager to join our team immediately. With a strong presence across all states in India, we offer a wide range of bioculture to our diverse customer base. As a Sales Manager, you will play a crucial role in driving our sales efforts and achieving our business goals.We offer a competitive salary package along with performance-based incentives and benefits. If you are a passionate and results-driven sales professional looking for an exciting opportunity to make a significant impact, we would love to hear from you.Job Description:We are looking for a detail-oriented and experienced Data Entry Specialist with a minimum of 2 years of data entry experience. The ideal candidate should have a proven track record of handling large volumes of data accurately and efficiently. In this role, you will be responsible for inputting, verifying, and maintaining various types of data into our systems.Responsibilities:Accurately input and update large volumes of data into the company's databases or systems.Verify and review data for errors, completeness, and compliance with established standards.Perform regular data quality checks to ensure accuracy and integrity of the data.Maintain confidentiality and security of sensitive information.Generate reports, summaries, and statistical analysis based on the collected data.Collaborate with other teams to ensure data consistency and resolve data-related issues.Identify and suggest process improvements to enhance data entry efficiency and accuracy.Stay updated on industry trends and best practices related to data entry and management.Provide training and support to other team members on data entry procedures and guidelines.Requirements:Minimum of 2 years of data entry experience, preferably in a similar industry.Strong attention to detail and accuracy with the ability to handle large volumes of data.Proficient in data entry software, spreadsheets, and database management systems.Excellent typing speed and data entry skills.Familiarity with data quality assurance techniques and procedures.Strong organizational and time management skills to meet deadlines and prioritize tasks.Ability to work independently and collaboratively as part of a team.Excellent communication skills, both written and verbal.High level of integrity and ability to handle confidential information.Joining our team as a Data Entry Specialist will provide you with an opportunity to contribute to our company's success by ensuring accurate and reliable data. We offer a supportive work environment, competitive compensation, and opportunities for professional growth.To apply, please submit your resume and cover letter to bionicshr@gmail.com. We appreciate all applications, but only shortlisted candidates will be contacted. Thank you for considering Bionics Enviro Tech as your next career move.Contact us:Email: bionicshr@gmail.comWhatsapp: 9095100030Website:https://www.bionicsenviro.comJob Type: Full-timeSalary: ₹9,533.30 - ₹20,000.00 per monthSchedule:Day shiftSupplemental pay types:Performance bonusAbility to commute/relocate:Chennai, Tamil Nadu: Reliably commute or planning to relocate before starting work (Required)Education:Bachelor's (Preferred)Experience:Microsoft Office: 2 years (Preferred)total work: 2 years (Preferred)Language:English (Preferred)Work Location: In personSpeak with the employer+91 9095100030",
    "jobDetails": "Full-time2 days ago",
    "qualifications": [
      "Database management",
      "Quality assurance",
      "Communication skills",
      "Data entry",
      "Time management",
      "Bachelor's degree"
    ],
    "benefits": [],
    "contact": "Speak with the employer+91 9095100030"
  },
  {
    "jobTitle": "Customer Support Specialist L1",
    "providingCompany": "Cision - Remote",
    "jobDescription": "Cision employs the brightest, most passionate people in the tech industry. We’d love for you to join our growing team! We invest in our people through training and professional development while supporting you along the way—all so you can meet your career goals. To us, the most important measure of our success is yours.\n\nThe Customer Support Specialist develops a culture of Customer Excellence through prompt and thorough handling of customer problems, answering product and service questions and suggesting information about other products or services.\n\nWork Timings: Standard UK hours on the following shift patterns. It will be rotational.\n\n7 AM - 3:30PM GMT/BST*(11:30 AM - 8:00PM IST)\n9 AM – 5:30 PM GMT/BST * (1:30 PM -10 PM IST)\n10 AM - 6:30PM GMT/BST*(2:30 PM - 11:00 PM IST)\n(*excluding one-hour unpaid lunch break)\n\nPrincipal duties and responsibilities:\nAnswers customer support requests via the telephone or the web promptly to enhance the customer experience.\nPatiently listens attentively to customers queries and manages the resolution or connects them with the appropriate teams to address their needs.\nQuickly learns the functions of the support tools and systems to log in and resolve customers’ requests.\nAccurately records and logs interactions with customers and updates account information and able to retrieve this information to create reports for management.\nResolves platform or service problems by clarifying the customers complaint, determining the root cause of the problem, selecting, and explaining the best solution to solve the problem, expediting correction or adjustment.\nWorks with management to maintain best practices for efficient communications with customers.\nAddress customer questions about new products or services.\nCollaborates with Customer Success Managers and Onboarding Consultants to ensure service excellence.\nContributes to bottom line sales by increasing customer satisfaction and reducing customer churn.\nUndertake other tasks or projects as requested by management.\n\nQualifications:\nExcellent communication skills.\nPrevious customer support experience (1 to 3 years).\nBachelor’s Degree.\nExcellent listening skills.\nAble to work as a team.\nAbility to work in a fast-paced environment.\nDetail orientated.\nProblem solver.\nGood analytical and troubleshooting skills.\nAble to resolve conflict.\nAs a global leader in PR, marketing and social media management technology and intelligence, Cision helps brands and organizations to identify, connect and engage with customers and stakeholders to drive business results. PR Newswire, a network of over 1.1 billion influencers, in-depth monitoring, analytics and its Brandwatch and Falcon.io social media platforms headline a premier suite of solutions. Cision has offices in 24 countries throughout the Americas, EMEA and APAC. For more information about Cision's award-winning solutions, including its next-gen Cision Communications Cloud®, visit www.cision.com and follow @Cision on Twitter.\n\nCision is committed to fostering an inclusive environment where all employees can be their authentic selves and perform at their best. We believe diversity, equity, and inclusion is vital to driving our culture, sparking innovation and achieving long-term success. Cision is proud to have joined more than 600 companies in signing the CEO Action for Diversity & Inclusion™ pledge and named a “Top Diversity Employer” for 2021 by DiversityJobs.com.\n\nCision is proud to be an equal opportunity employer, seeking to create a welcoming and diverse environment. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, gender identity or expression, sexual orientation, national origin, genetics, disability, age, veteran status, or other protected statuses.\n\nCision is committed to the full inclusion of all qualified individuals. In keeping with our commitment, Cision will take the steps to assure that people with disabilities are provided reasonable accommodations. Accordingly, if reasonable accommodation is required to fully participate in the job application or interview process, to perform the essential functions of the position, and/or to receive all other benefits and privileges of employment, please contact hr.support@cision.com\n\nPlease review our Global Candidate Data Privacy Statement to learn about Cision’s commitment to protecting personal data collected during the hiring process.",
    "jobDetails": "Full-time",
    "qualifications": [
      "Analysis skills",
      "Customer support",
      "Communication skills",
      "Bachelor's degree"
    ],
    "benefits": [],
    "contact": ""
  },
  {
    "jobTitle": "Product Manager , High-Tech",
    "providingCompany": "Model N - Hyderabad, Telangana",
    "jobDescription": "As Product Manager, you will guide a team that is charged with a product line contribution. This extends from increasing the market share of existing products to developing new products for the company. You will build products and methodologies from existing ideas, and help to develop new ideas based on your experience and your contact with customers and internal stakeholders. You must possess a unique blend of business and technical savvy; and the drive to make that vision a reality. You must enjoy spending time with customer representatives and services to understand their problems, and spending time on the details and the process of deploying the product. You must be able to communicate with all areas of the company. You will work with an engineering counterpart to drive product requirements. You will serve as the internal and external expert for your product offering, occasionally working with the sales channel and key customers.\nJob Responsibilities\nUnderstand vertical domain, shape roadmap and drive product releases per roadmap\nRequirement discovery by directly interacting with customers and prospects\nServe as a Product Owner - write product specs , own use cases and stories, detail out the\npriorities among new feature development, customer satisfaction, and support\nProvide guidance to the product development and product QA teams - elaborating /\nclarifying requirements\nConduct business scenario testing and documentation reviews, internal training, demos\nServe as an expert on your product\n\nJob Qualification:\nBachelor’s Degree in Computer Science or any Engineering degree; MBA is a plus\n6+ years of total experience in the software industry; 4+ years of experience in complex enterprise application\nExperience with Incentives, Rebates, Market Development Funds, Channel, and Distribution in High Tech industry is preferred\n2+ years experience in Product Management\nStrong analytical skills, creative problem solving\nExtremely Detail Oriented\nStrong email, phone and face-to-face communication skills\nExperience in Agile methodology is a strong plus\nKnowledge of the High Tech industry, particularly of pricing, and channel Sales, is a strong plus.\nThis position requires travel to customer and non-customer sites in North America and Europe (up to 15%)\n\nAt Model N, we believe our collective success stems from the uniqueness of every individual's diverse backgrounds, experiences, and expertise; we call this the N Factor. So don’t allow uncertainty to keep you from applying to join our team. If you don’t meet the exact criteria but can demonstrate your skillset is the best for the job, we’d love to talk with you. We’re curious to know, what’s your N Factor?\n\nAbout Model N\n\nModel N enables life sciences and high tech companies to drive growth and market share, minimizing revenue leakage throughout the revenue lifecycle. With deep industry expertise and solutions purpose-built for these industries, Model N delivers comprehensive visibility, insight and control over the complexities of commercial operations and compliance. Our integrated cloud solution is proven to automate pricing, incentive and contract decisions to scale business profitably and grow revenue. Model N is trusted across more than 120 countries by the world’s leading pharmaceutical, medical technology, semiconductor, and high tech companies, including Johnson & Johnson, AstraZeneca, Stryker, Seagate Technology, Broadcom and Microchip Technology. For more information, visit www.modeln.com.\n\nWe’re constantly growing and may have something for you later on if this is not the right opportunity for you. Check out our career site to learn more about Model N or view other jobs: https://www.modeln.com/company/careers/",
    "jobDetails": "Full-time",
    "qualifications": [
      "Analysis skills",
      "Product management",
      "Communication skills",
      "Agile",
      "Enterprise Software",
      "Bachelor's degree",
      "Master's degree",
      "M.B.A."
    ],
    "benefits": [],
    "contact": ""
  },
  {
    "jobTitle": "Business Development ( Fresher)",
    "providingCompany": "KPL Tech Solution Private Ltd - Noida, Uttar Pradesh",
    "jobDescription": "#Job Description-●\tIdentifying sales leads.●\tGenerating business by selling IT services like SEO/SMO/PPC/Website development/Mobile applications)●\tPitching IT services (Digital Marketing/SEO/SMO/Website development/Mobile applications)●\tResearching organizations and individuals online to identify new leads and potential markets.●\tContacting clients to understand their needs.●\tDeveloping quotes and proposals●\tNegotiating and renegotiating by phone & email.●\tHave to work on sales and follow up.●\tGive presentations about company services to clients.●\tEstablish a good relationship with prospective clients, closures of sales for revenue generation.●\tGenerate contact details of potential clients.●\tMeet and exceed monthly and quarterly revenue targets.Job Types: Full-time, Regular / Permanent, FresherSalary: ₹18,000.00 - ₹25,000.00 per monthSchedule:Fixed shiftMonday to FridayNight shiftUS shiftSupplemental pay types:Performance bonusAbility to commute/relocate:Noida, Uttar Pradesh: Reliably commute or planning to relocate before starting work (Required)Education:Master's (Preferred)Language:English (Required)Shift availability:Night Shift (Required)Speak with the employer+91 7983739272",
    "jobDetails": "Full-time | New-Grad",
    "qualifications": [
      "Master's degree"
    ],
    "benefits": [],
    "contact": "Speak with the employer+91 7983739272"
  },
  {
    "jobTitle": "International Sales Executive",
    "providingCompany": "Tech Mahindra - Pune, Maharashtra",
    "jobDescription": ",Responsibilities:Make outbound calls to potential customers based on assigned leads or lists.Introduce and explain products or services to customers in a clear and compelling manner.Identify customer needs and recommend appropriate products or services that meet their requirements.Provide accurate information about pricing, features, and benefits of products or services.Answer customer questions and address any concerns they may have.Use persuasive selling techniques to close sales and achieve assigned sales targets.Maintain a high level of product knowledge to effectively communicate and answer customer inquiries.Update customer records and enter relevant information into the CRM (Customer Relationship Management) system.Follow up with customers who have shown interest but have not made a purchase, in order to convert them into sales.Collaborate with team members and supervisors to meet individual and team sales goals.Adhere to all company policies and procedures, including call scripts and compliance guidelines.Continuously improve sales skills and knowledge through training and coaching sessions.For more Details Contact:- RM00775572@TechMahindra.com,BK00938544@TechMahindra.com,MS00904858@TechMahindra.com,NG00903607@TechMahindra.com,vs00965714@techmahindra.comJob Type: Full-timeSalary: ₹350,000.00 - ₹490,000.00 per yearBenefits:Health insuranceProvident FundSchedule:Night shiftRotational shiftUK shiftAbility to commute/relocate:Pune, Maharashtra: Reliably commute or planning to relocate before starting work (Required)Education:Higher Secondary(12th Pass) (Required)Experience:Sales: 1 year (Required)Language:English (Required)Work Location: In person",
    "jobDetails": "Full-time",
    "qualifications": [
      "Sales",
      "12th Pass"
    ],
    "benefits": [
      "Health insurance"
    ],
    "contact": ""
  },
  {
    "jobTitle": "Process Executive - US (Night Shift)",
    "providingCompany": "Equiniti - Bengaluru, Karnataka",
    "jobDescription": "Management Level\n\nI\n\nAbout Equiniti:\nEquiniti is a leading Shareholder Management Fin-tech Company, serving as the number one share registrar in the UK and number two in the USA. It specializes in providing top-notch infrastructure, technology, and solutions for shareholder administration, pension, remediation, and credit technology. With over 6000 employees, it supports 37 million people in 120 countries. EQ's vision is to be the leading global share registrar, offering complementary services to its client base and our values set the core foundations to our success.\n\nEQ India is a Global competency centre of EQ Group. Our Indian team is an integral part of our success, with 1300 employees operating out of Bangalore and Chennai, forming 25% of our global workforce, and 40% of our employees being women. We are recognised as Top Employer in India by Top Employer Institute.\n\nWe are TRUSTED to deliver on our commitments, COMMERCIAL in building long term value, COLLABORATIVE in our approach and we IMPROVE by continually enhancing our skills and services.\n\nThere has never been a better time to join EQ.\n\nDivision/Business Function: (Please select the division for which you are going to hire)\n\nIT - Our Technology teams in India deliver best-in-class Applications and Infrastructure services to the Group and are involved in key Digital Transformation initiatives that are being undertaken by the Group, including re-platforming, transformation to the Cloud and Application modernization projects. we've over 100 IT products supporting various clients across UK, Europe & US.\n\nor\n\nFSS – The Finance Shared Services is the backbone of our Finance Organisation, providing high quality data for Decision support, creating scalable processes to add value to customers by attracting and investing in the right talent. We cater AP, AR, R2R, P2P, Global procurement, Payroll, Regulatory reporting, statutory reporting, internal audit, â€¦ to our EQ group.\n\nor\n\nOps - Our operations team in India serves as an extension of the global operations business located in the UK and US. The team in India provides comprehensive support across various critical operational areas, including Share registration services, retirement solutions, Investment Services, Employee Services, KYC Operations, contact centre operations, and Reconciliation services. Within these functions, we handle both voice and non-voice tasks. Our units efficiently process a large volume of complex transactions, ensuring adherence to client SLAs regarding quality and timelines. Additionally, we possess expertise in managing regulated activities, which are overseen by highly competent resources dedicated to this specific role.\n\nJob Summary:\nGive a brief summary, in paragraph format, of how the role fits into the department and Equiniti. Describe the purpose of the job.\n\nSample Template: Join our team at EQ India and take on a crucial role in our IT department. We offer the opportunity to work on high-quality projects, adhering to strict coding international standards and using the latest technologies. As an expert in ______ (Eg. OOPS) and _____ (E.g .NET Framework), you will have the chance to grow and develop your skills, working with a team of talented professionals. You will also have the opportunity to learn about financial solutions and procedures and Shareholding solutions. Come and be a part of our wonderful team at EQ India!\n\nJob Purpose\n\nTo carry out a range of assigned clerical / support duties in accordance with predetermined procedures and service standards under appropriate guidance and direction.\n\nCore Responsibilities\n\nCarry out a range of assigned clerical / support duties ensuring prompt and accurate completion of all relevant account / data administration requirements within agreed service standards.\nRespond to a range of general standard processing enquiries referring to senior colleagues where appropriate.\nContribute to the completion of the team's workload.\nImprove own skills as knowledge within the operational team taking opportunities to identify area for improvement to processes and service.\nUndertake duties at a similar level as required.\nEnsure compliance with Equiniti's procedures, standards and reporting requirements, together with all relevant regulatory and statutory requirements, where appropriate implementing actions to protect our business at all times.\nShould possess strong analytical skills.\nKnowledge on accounting concepts and principles.\nPrior experience in Bank/SL & GL reconciliation process will be an added advantage.\nAbility to manage high volume.\nStrong knowledge on MS office applications.\nShould have high attention to details.\nAlways to undertake the duties of this role in accordance with the requirements of the company's Regulators, including FCA's Principles for Business.\nComplete work within the security arrangements of Equiniti. Any deliberate contravention of these procedures may lead to disciplinary procedure.\nEnsure that all work is undertaken within the quality system.\nEnsure that work and ethetics comply with all security arrangements both physical and information.\n\nSuggested Performance Measures\n\nTimely completion of own work / contribution to team workload\nMeeting targets for accuracy, quality, volume and agreed service levels\nSatisfactory resolution of queries\nAdherence to procedures and regulations\nContribution to continuous improvement\nOngoing development of own knowledge and skills\nDemonstrate willingness to contribute to team beyond own immediate tasks\nQuality of support given to colleagues\nDevelopment of technical knowledge and skill\nContribution to target achievement and team goals\nSuccessful delivery of task\n\nKey Competencies\n\nDeliver quality to our customers.\nDrive to improve results and standards\nWorking together\nTaking ownership and responsibility\nLeadership\nTechnical proficiency\n\nSkills\n\nOral Communication:\nUses clear and concise speech to out message across effectively\n\nWritten Communication:\nSelects appropriate information to complete standard letter.\nProduces accurate and legible written work at all times.\n\nSelf / Work Organisation:\nUses straightforward personal planning to organise own work effectively.\nKnows where to find things and adheres to deadlines\n\nKeyboard / Software Organisation:\nUses a keyboard on one or more systems, understanding functions for producing a range of outputs.\n\nOrganisational Awareness:\nHas an understanding of the main activities of own business unit/area.\n\nProcedural / Product / Specialist Knowledge:\nA good understanding of specified products, routine tasks and procedures within own team, including some non-routine activities.\nWhere appropriate is aware of regulatory practices and constraints which impact on own work.\n\nBenefits:\nBeing a permanent member of the team at EQ you will be rewarded by our company benefits, these are just a few of what is on offer:\n\n31 days + 9 bank holidays (UK)\nBusiness related certification expense reimbursement\nComprehensive Medical Assurance coverage for dependents & Parents\nTwo-way cab transport for staff working in UK & US shift\nAccidental & Life cover 3 times of concerned CTC\n\nWe are committed to equality of opportunity for all staff and applications from individuals are encouraged regardless of age, disability, sex, gender reassignment, sexual orientation, pregnancy and maternity, race, religion or belief and marriage and civil partnerships. Please note any offer of employment is subject to satisfactory pre-employment screening checks.",
    "jobDetails": "Part-time1 day ago",
    "qualifications": [
      "Regulatory reporting",
      "Accounting",
      "Analysis skills",
      "Communication skills",
      ".NET"
    ],
    "benefits": [
      "Commuter assistance"
    ],
    "contact": ""
  },
  {
    "jobTitle": "Asst. manager - Administrations (Human Resource & Admin)",
    "providingCompany": "vaibhav tech solutions - Pune, Maharashtra",
    "jobDescription": "Location: Pune (M.H)\n\nSalary: Up to 7 LPA\n\nBenefits:Stable Company, Career growth, Fun & professional Environment\n\nPOSITION DETAILS\n\nPRIMARY POSITION OBJECTIVE\n\nStrategizing and executing ADMINISTRATIVE interventions for the organization. It would include the following:\n\nHR policy development, office administration, labour and employment laws and compliance handling, payrolls, time & attendance, managing reimbursement & travel process, welfare activities.\n\nWill be responsible for setting up, improving & optimizing existing and new office infrastructure over immediate and midterm horizon.\n\nThe position will support technician management at various sites or offices to business managers. The office assistants will report into this position. The person will act as the first port of call to employees and external partners for all HR related queries, most of the employee documentation, including contracts, recruitment paperwork and starter packs. The AM – Admin may need to provide support (as needed/requested) such as onboarding, exits, talent development and retention strategies and annual business planning support etc.\n\nDUTIES & RESPONSIBILITY\n\nAssisting in below given activities\n\nThe position is responsible for all office administrative activities including managing, optimizing, improving existing office facilities, and setting up new office facilities as per strategic and annual business plans.\nThis position is responsible for managing Payroll, reimbursements & administration activities of the company, ensuring compliance accuracy on monthly basis.\nForming and maintaining employee records, updating databases internally, providing relevant employee information (e.g., leaves of absence, sick days and work schedules)\nTrack the attendance of all staff day wise in Greythr Software as per organization requirement and communication. Track leave database, eligibility, availed and closing balances of leaves for staff. Calculating the correct amount incorporating overtime, deductions, bonuses etc. with assistance of a computer system Calculation and deposit of monthly liability of TDS on salaries\nManaging Payroll related legal & statutory Compliance (Tax, PF, ESIC, PT, Bonus, Gratuity LWF & Minimum wages)\nManage employees’ grievances. Being the first point of contact for employees on any HR related queries\nEnforces management guidelines by preparing, updating, and recommending human resource policies and procedures.\nSupport technicians and on-site egg management support. Handling office asst. undertaking admin project\nJoining formality of new joinees, also handling exit interviews and Full and Final settlements.\nPreparing and amending where necessary HR documents, i.e., employment contracts and recruitment guides\nHelping with various arrangements internally, from travel to processing expenses, Ensuring Employee Benefits including Employee reimbursements as per company policy\nSupport HR team on such as on boarding, exits, talent development and retention strategies and annual business planning support etc. as per business needs.\n\nREQUIREMENT\n\nESSENTIAL CRITERIA\n\nAny Graduate, Degree/Diploma in HR management, Preferably MBA HR.\n4 to 7 years of proven experience as payroll & admin specialist.\nOn-job experience of HR Payroll & Compliance handling,\nSolid understanding of employment legislation, statutory requirements & labour laws. Hands-on experience of handling labour/ technicians will be an advantage.\nManaging and supporting office infrastructure will be an advantage.\nHandling employee grievances and problem-solving experience.\nComputer savvy – Microsoft Excel, Microsoft word and power point\nStrong phone, email and in-person communication skills\nAbility to work independently\n\nWhy should you apply?\n\nExcellent Training opportunities that foster career growth\nGenerous financial Package.\nStrong workplace culture.\nlot more learning, can increase your horizon of knowledge in various fields.",
    "jobDetails": "",
    "qualifications": [
      "Payroll",
      "Office experience",
      "Microsoft Excel",
      "Microsoft Powerpoint",
      "Human resources",
      "Bachelor's degree",
      "Diploma",
      "Master's degree",
      "M.B.A."
    ],
    "benefits": [],
    "contact": ""
  },
  {
    "jobTitle": "P&M Engineers (Mechanical) - Chennai Metro (UG Tunnel & Stations)",
    "providingCompany": "TATA Projects - Tamil Nadu",
    "jobDescription": "Job Description\n\nWe are conducting Walk-In Interviews for Plant & Machinery (Mechanical) Engineers for Chennai Metro Project (Underground Tunnel & Station Package) on 01 & 02 July 2023 at our Noida Office.\n\nInterested candidate with similar experience can apply for this Vacancy and Shortlisted Candidates will be called for Personal round of Interviews either on 01 / 02 July 2023 at Noida.\n\nRole:\nMinimum 3-15 years of Experience working in similar projects (UG / TBM / NATM / Heavy Civil)Study project requisite and prepare the necessary documents/details supporting project.Should be able to prepare the P&M budget for project and monitor the cost.MIS report to HO/RO as per SOP.Coordination with project team for the deployment schedule of assets required for execution as per project schedule and communicate to RO team for deployment.Commissioning and Maintenance & Repairs of equipment deployed at site.Maintain minimum stock of maintenance spares, lubricants and consumables.Initiate the process for disposal of asset based on the technical evaluation report.Ensure the compliance with respect to ISO 9001, ISO 140001 and ISO 45001 standards.Conduct training for technician and P&M staff for safe operation of equipment.Should be aware about the safety accessories required for construction equipment.Certify the invoice of equipment purchased at site.Check and certify the measurement book for Hired equipment working at site\nCandidate must hold full time education in Mechanical (Diploma or B.E. / B.Tech).\n\nONLY shortlisted candidates will be called for in-person interview at Noida.\n\nRole:Mechanical Engineer\n\nSalary: Not Disclosed by Recruiter\n\nIndustry:Engineering & Construction\n\nDepartment:Construction & Site Engineering\n\nRole Category:Construction Engineering\n\nEmployment Type:Full Time, Permanent\n\nKey Skills\nPlant Maintenance\nMachine Maintenance\nSkills highlighted with ‘‘ are preferred keyskills\n\nEducation\n\nUG:B.Tech/B.E. in Mechanical,Diploma in Mechanical\n\nCompany Profile\n\nTata Projects\n\nTata Projects Limited\n\nCompany Info\n\nContact Company:Tata Projects\n\nAddress:1-7-80 TO87,MITHONA TOWERS,,PRENDERGHAST ROAD,, SECUNDERABAD, Hyderabad, Telangana, India",
    "jobDetails": "Full-time11 days ago",
    "qualifications": [
      "ISO 9001",
      "Bachelor's degree",
      "Diploma"
    ],
    "benefits": [],
    "contact": ""
  },
  {
    "jobTitle": "Freshers Hiring for IT Positions-Pronix Talent Hunt",
    "providingCompany": "Pronix - Hyderabad, Telangana",
    "jobDescription": "Posted On: 05 Mar 2022\nJob Type: Full Time\nCountry: INDIA\nLocation: Hyderabad/REMOTE\nNo of Positions: 15\n\nSkills\n\nImmediate Job Openings for Freshers/ Entry Level Talent in IT Services Sales/Business Development, Software Development, US IT Recruiting/Staffing Jobs - Multiple Positions for Hyderabad, India/REMOTE/Hybrid working\n\n\"Pronix is looking for talented professionals to help us continue to build our reputation as a global leader in IT/Professional services and IT/Digital Solutions and Services.\"\n\nPRONIX is an Information Technology company stretching its services into developing Custom Software Products &Applications, IT Consulting/Staffing Services for Digital Applications Architecture/Design, Solutions/Software/API Development, ERP/CRM/Data Integration Solution, QA Testing and Application Support of Enterprise Solutions.\n\nJob Description\n\n1. IT Business Development/IT Sales specialists for IT Solutions/Staffing\n\nStrong communication and IT fluency\nThe ability to handle pressure and meet deadlines\nGood presentation skills\nShould have excellent marketing strategies, sales management, social adept\nEligibility : Any Degree\n\n2. Software Development Engineers(EntryLevel/Junior Level)\n\nSoftware Development\nJava/ .NET/Angular/ React/API\nUI/UX, Product Designers\nAPI Developers\nQA, DevOps, Cloud\nEligibility : B.Tech/ M.Tech/MCA/BCA/BSC(Computers)\n\n3. US IT Staffing Recruiters(EntryLevel/Junior Level)\n\nBasic knowledge of Talent Recruitment lifecycle\nExcellent communication with convincing skills\nNegotiation skills, positive attitude\nShould be familiar with social networking sites.\nWilling to do nightshifts(IST)\nEligibility : Any Degree\nEmail the resume along with Full contact Details/LinkedIn Profile at hrindia@pronixinc.com",
    "jobDetails": "Full-time",
    "qualifications": [
      "React",
      ".NET",
      "Recruiting",
      "Negotiation",
      "Presentation skills",
      "M.C.A.",
      "Bachelor's degree",
      "Master's degree"
    ],
    "benefits": [],
    "contact": ""
  },
  {
    "jobTitle": "Fresher(Electronic products company)",
    "providingCompany": "Global Talent Pool - Bengaluru, Karnataka",
    "jobDescription": "Bangalore, Hyderabad\n\nShare\nRSS Feed\n\nGenerating Business Leads, Cold calling\nPreparing Quotations, Offers, Proposals, etc.Maintaining Regular Contact with Existing & Prospective CustomersFollow Up & Negotiations with ClientsCoordination between the H.O And the Customer Regarding Deliveries & DispatchesFollow Up of Payments, C Forms and Controlling of Outstanding Dues.\nExperience 0 - 1 Years\nSalary 3 Lac To 5 Lac P.A.\nIndustry Manufacturing / Production / Quality\nQualification B.Tech/B.E\nKey Skills Sales Marketing\n\nAbout Company\n\nCompany Name\n\nMumbai Base Company\n\nAbout Company Kindly inbox for more company details.\nContact Person Mamta\nMobile 9110123704\nEmail ID mamta.gtp@gmail.com",
    "jobDetails": "New-Grad2 days ago",
    "qualifications": [
      "Marketing",
      "Bachelor's degree"
    ],
    "benefits": [],
    "contact": ""
  },
  {
    "jobTitle": "Technical Coordinator",
    "providingCompany": "Intertoons Internet Services Pvt.Ltd. - Ernakulam, Kerala",
    "jobDescription": "Intertoons Internet Services Pvt. Ltd., a leading Web Development company specializing in eCommerce web and mobile app development, is seeking a dedicated Technical Coordinator to join our team. As a Technical Coordinator, you will be responsible for coordinating technical activities and ensuring the successful execution of projects. We strongly encourage female candidates to apply and create a diverse and inclusive work environment. Freshers with relevant technical qualifications are also welcome.Responsibilities:Technical coordination: Collaborate with development teams to coordinate technical aspects of eCommerce web and mobile app projects.skills and availability. Monitor resource utilization and make adjustments as needed.Technical guidance: Provide technical expertise and guidance to team members, assisting them in overcoming challenges and ensuring project success.Quality assurance: Implement quality control processes to ensure adherence to industry standards, best practices, and client requirements in web and mobile app development.Risk management: Identify and manage potential risks. Develop contingency plans to mitigate risks and address technical issues that arise during the development process.Communication: Serve as a central point of contact for technical queries and updates. Facilitate effective communication among team members, stakeholders, and clients.Documentation: Maintain accurate project documentation, including technical specifications, progress reports, and change requests.Research and innovation: Stay updated with the latest web and mobile app development trends, tools, and technologies. Recommend innovative solutions to enhance development processes and deliver superior results.Qualifications:Technical Graduation: BCA, B.Sc. Computer Science, MCA, B.Tech, B.Sc. IT, or equivalent.Experience: Freshers with relevant technical qualifications are encouraged to apply.Technical skills:Proficiency in web development technologies, including HTML, CSS, JavaScript, and relevant frameworks (e.g., React, Angular, Vue.js).Familiarity with mobile app development frameworks (e.g., React Native, Flutter) is a plus.Knowledge of eCommerce platforms (e.g., Magento, Shopify) and payment gateways.Understanding of database systems (e.g., MySQL, MongoDB) and RESTful APIs.Project management skills: Ability to plan, organize, and prioritize tasks effectively.Familiarity with project management methodologies (e.g., Agile, Scrum) is advantageous.Communication skills: Excellent verbal and written communication skills in English to effectively convey technical concepts to both technical and non-technical stakeholders.Problem-solving abilities: Analytical mindset with strong problem-solving skills. Demonstrated ability to troubleshoot and address technical challenges.Attention to detail: Meticulous approach to quality assurance and documentation.Team player: Ability to collaborate effectively in a team environment and foster a positive working atmosphere.Job Type: Full-timeSalary: ₹15,000.00 - ₹20,000.00 per monthDay range:Monday to FridayShift:Day shiftAbility to commute/relocate:Ernakulam, Kerala: Reliably commute or planning to relocate before starting work (Required)Experience:total work: 1 year (Preferred)Work Location: In personSpeak with the employer+91 9847922500",
    "jobDetails": "Full-time",
    "qualifications": [
      "React",
      "Web development",
      "CSS",
      "Scrum",
      "Flutter",
      "M.C.A.",
      "B.Sc",
      "Bachelor's degree",
      "Master's degree"
    ],
    "benefits": [],
    "contact": "Speak with the employer+91 9847922500"
  },
  {
    "jobTitle": "IT Project Manager(US Healthcare)",
    "providingCompany": "Shukla Information Solutions Pvt Ltd - Ahmedabad, Gujarat",
    "jobDescription": "We are leading managed IT company in Houston, Texas looking for Client success manager and project manager to work with all our medical offices clients in Houston, TX, lead our offshore team and support their EHR, different billing/scheduling software, IT and more.JOB DETAILSJob Title: Account and Project ManagerCompany: Infotech Houston Solutions LLCManaged IT company looking for Project Manager and Account Manager to provide following services to their clients\\* Primary contact for all IHS US-based clients. Employee will be given US Cell #.\\* Conduct meetings, understand client needs, manage projects.\\* Become a primary bridge between Houston and Ahmedabad team\\* Manage day to day onsite tech schedules and dispatch techs when necessary.\\* Work closely with IHS US leadership, work with management and operations team to execute tasks\\* Help maintain / track ongoing projects. Take a lead.\\* Stay highly motivated and client focused.Job Types: Full-time, Regular / PermanentPay: ₹30,000.00 - ₹60,000.00 per monthBenefits:Flexible scheduleFood providedLeave encashmentPaid time offProvident FundSchedule:Monday to FridayNight shiftUS shiftSupplemental pay types:Overtime payYearly bonusAbility to commute/relocate:Ahmedabad, Gujarat: Reliably commute or planning to relocate before starting work (Required)Experience:total work: 3 years (Preferred)Shift availability:Night Shift (Preferred)Speak with the employer+91 9313630913",
    "jobDetails": "Full-time",
    "qualifications": [],
    "benefits": [
      "Paid time off",
      "Flexible schedule",
      "Food provided"
    ],
    "contact": "Speak with the employer+91 9313630913"
  },
  {
    "jobTitle": "RMC MARKETING EXECUTIVE",
    "providingCompany": "UDAY INFRA PROJECTS (UDAY GROUP OF INDIA COMPANY) - Bharuch, Gujarat",
    "jobDescription": "Sales & Marketing – RMC(D)UDAY Infra Project has a Ready-Mix Concrete Division, which supplies ready mix concrete of dependable quality, using JK LAXMI & ULTRATECH (as per Client Requirement) cement, and ensuring reliable quality. The total number of RMC units now stands at FIVE in Dahej, Panoli, Vilayat (Sayakha) & Bharuch, Gujarat.UDAY RMC (Ready Mix Concrete) Division is looking for good talent for their Business Development.Position Sales/Marketing Officer / Senior Sales/Marketing officer (Institutional Sales)Qualification Diploma / BE / B. Tech (Civil Engineering) / MBA (Marketing)Job Location Dahej & Bharuch, GujaratNos. of Positions 02Experience 1 to 5 years in RMC / Building Material sales and marketing.Experience looking for· Identify new projects in the assigned areas and report thereof· Gather the contact details of key decision-makers of the new projects· Meet the potential customers and appraise them of the product RMC (First Impression Matters)· Promote the Product within the communities of Project Management Consultants / Builders and other interested parties (Institutional Sales).· Extend necessary support in Branding / Promotional ActivitiesInterested candidates send their CV’s to hr@udaygroupindia.com & Contact HR-9909965416,Functional Area Business DevelopmentJob Type Full TimeJob Location BHARUCH, GUJARATJob Type: Full-timeSalary: ₹25,000.00 - ₹60,000.00 per monthBenefits:Cell phone reimbursementFood providedHealth insuranceInternet reimbursementProvident FundSchedule:Day shiftSupplemental pay types:Commission payPerformance bonusAbility to commute/relocate:Bharuch, Gujarat: Reliably commute or planning to relocate before starting work (Required)Education:Bachelor's (Preferred)Experience:Lead generation: 10 years (Preferred)total work: 1 year (Preferred)Marketing: 1 year (Preferred)Language:English (Preferred)Work Location: In personSpeak with the employer+91 9909965416",
    "jobDetails": "Full-time3 days ago",
    "qualifications": [
      "Project management",
      "Lead generation",
      "Marketing",
      "Bachelor's degree",
      "Diploma",
      "Master's degree",
      "M.B.A."
    ],
    "benefits": [
      "Health insurance",
      "Food provided",
      "Cell phone reimbursement",
      "Internet reimbursement"
    ],
    "contact": "Speak with the employer+91 9909965416"
  },
  {
    "jobTitle": "Collections Representative II",
    "providingCompany": "Toast - Chennai, Tamil Nadu",
    "jobDescription": "Toast is driven by building the restaurant platform that helps restaurants adapt, take control, and get back to what they do best: building the businesses they love.\n\nThe Billing Collections Specialist is an integral part of Toast's Billing & Collections team and is responsible for supporting the collections operations activities. This is a challenging role that requires problem-solving and the ability to record complex billing transactions in various systems while providing excellent customer service and remaining financially responsible for Toast. This role will involve significant interaction with customers as well as internal stakeholders to make a tremendous impact for all. The ideal candidate is passionate, empathetic, and collaborative given that many solutions require working cross functionally with numerous internal partners.\n\nKey Responsibilities\n\nReview customer accounts to proactively communicate with customers and internal partners to ensure collection of all outstanding invoice totals\nReview, investigate, and resolve a steady volume of daily inbound cases\nRespond to customer account inquiries and follow through to resolution in a timely manner\nWork collaboratively with internal teams to ensure customers and their internal contacts are aware of outstanding balances\nPost customer payments, refunds, and deposits by recording ACH and credit card transactions\nProvide weekly reporting related to past due accounts and give recommendations for resolution\nWork closely with Care and Accounting teams to identify customer trends and behaviors\nCollaborate with other teams to identify and implement efficiencies in the collections process\nConsistently meet strict deadlines related to month-end close.\nAd hoc projects as necessary\n\nQualifications\n\nWe are seeking a highly organised, tech-savvy, intellectually curious candidate with excellent communication skills and the ability to learn quickly.\n\nB.com or graduation related to Finance and 1-2 years of relevant experience\nExtreme attention to detail and meticulous organisation\nStrong technical aptitude\nExcellent written and verbal communication skills\nConfidence prioritising and making time sensitive decisions in a fast-paced environment\nExcellent time management and strong sense of urgency\nRelentless problem-solver\n\nJob Details\n\nWork Timings: 2pm - 11pm IST (Hybrid)\n\nBonus Skills:\nPrior experience with Netsuite, SalesForce, of other similar SaaS- based ERP and CRM systems\n\nWe are Toasters\n\nDiversity, Equity, and Inclusion is Baked into our Recipe for Success.\n\nAt Toast our employees are our secret ingredient. When they are powered to succeed, Toast succeeds.\n\nThe restaurant industry is one of the most diverse industries. We embrace and are excited by this diversity, believing that only through authenticity, inclusivity, high standards of respect and trust, and leading with humility will we be able to achieve our goals.\n\nBaking inclusive principles into our company and diversity into our design provides equitable opportunities for all and enhances our ability to be first in class in all aspects of our industry.\n\nBready* to make a change? Apply today!\n\nToast is committed to creating an accessible and inclusive hiring process. As part of this commitment, we strive to provide reasonable accommodations for persons with disabilities to enable them to access the hiring process. If you need an accommodation to access the job application or interview process, please contact candidateaccommodations@toasttab.com.",
    "jobDetails": "10 days ago",
    "qualifications": [
      "Communication skills",
      "Salesforce",
      "Time management",
      "NetSuite",
      "Bachelor's degree"
    ],
    "benefits": [],
    "contact": ""
  },
  {
    "jobTitle": "Furniture sales",
    "providingCompany": "Pourbrain tech pvt ltd - Bengaluru, Karnataka",
    "jobDescription": "Furniture Sales Associate Duties & ResponsibilitiesTo write an effective furniture sales associate job description, begin by listing detailed duties, responsibilities and expectations. We have included furniture sales associate job description templates that you can modify and use.Sample responsibilities for this position include:Maintain knowledge of all vendor products, pricing, options, finishes, detailsProvide knowledge of merchandise to customers, explaining complex features and differences between merchandise and providing purchasing advice to customersAssist in the safe maintenance, appearance, merchandising and pricing of store to company and District standardsServes customers by selling productsSALES Crossselling products and knowing layout of the storeProvide superior customer service and support to designers and endMeet or exceed monthly quarterly and annual salesProvide superior customer service and support to designersMaintain updated customer information including contact data specialEnter new clients on customer card, collect Resale form to turn into corporateJob Types: Full-time, Regular / PermanentSalary: ₹557,098.18 - ₹858,298.29 per yearBenefits:Health insuranceInternet reimbursementLife insuranceProvident FundSchedule:Day shiftSupplemental pay types:Performance bonusQuarterly bonusYearly bonusAbility to commute/relocate:Bangalore City, Karnataka: Reliably commute or planning to relocate before starting work (Required)Experience:B2B sales (Preferred)Furniture sales (Preferred)4 years (Preferred)Speak with the employer+91 9315266130",
    "jobDetails": "Full-time10 days ago",
    "qualifications": [
      "Pricing",
      "Furniture sales",
      "B2B sales"
    ],
    "benefits": [
      "Health insurance",
      "Internet reimbursement",
      "Life insurance"
    ],
    "contact": "Speak with the employer+91 9315266130"
  },
  {
    "jobTitle": "Talent Acquisition Junior Associate",
    "providingCompany": "LAUNDRYHEAP - Bengaluru, Karnataka",
    "jobDescription": "Founded in 2014, Laundryheap is one of the young, leading and fastest growing UK-based tech startups. Our dedicated teams pick up, clean and deliver laundry and dry cleaning within 24 hours. We are currently operating in 11 countries, including the UK, US, and the UAE. Our aim is to grow further, and we want you to be part of it!\n\nThe world and the surrounding industry are changing constantly. To keep up with innovation, fast growth and an increase in emerging customer needs, you have to be confident and fearless. We are looking for confident, brave and creative minds to help us drive Laundryheap forward. Your opportunities and development are limitless!\n\nWe are currently looking for a Talent Acquisition Junior Associate in our HR division to join our fast-growing team at our office in Bengaluru, India.\n\nTHE ROLE:\nReporting to the Assistant Manager- Talent Acquisition & International Markets, the Talent Acquisition Junior Associate will be responsible for providing an efficient recruitment service to the business. The role would suit a motivated administrator with a high degree of attention to detail and/or a keen interest in working in Recruitment or Human Resources.\n\nThe roles & responsibilities can be broadly outlined as follows:\n\nPosting jobs on BambooHR (company portal) and relevant websites directly\nSourcing and attracting candidates by using databases, job boards, social media, etc.\nScreen candidate's resumes and job applications\nScheduling / Conducting interviews, liaising with line managers and candidates; booking rooms, preparing interview schedules, and issuing supporting paperwork and documentation\nAssess applicants’ relevant knowledge, skills, soft skills, experience, and aptitudes\nProviding administrative support to ensure the successful conclusion of each recruitment process\nOnboard new employees in order to become fully integrated\nTaking care of office administration in general and be the point of contact for all related queries\n\nRequired Skills:\n1-2 years of work experience as a Recruiter\nHands-on experience with various selection processes (video interviewing, phone interviewing, reference check, etc)\nExcellent communication and interpersonal skills\nStrong decision-making skills\nBasic Excel and G-suite skills\nDegree in Human Resources Management\nFamiliarity with Human Resources Information Systems (HRIS)\nPrevious experience in a startup is a big plus\nExposure to IT recruitment is preferred\n\nAs we are an international brand working with different time zones, we would require the potential candidate to be flexible with UK shifts.\n\nWork type:\n9-hour shift (8 working hours + 1 hour break)\n5 days a week (Saturday-Sunday off)\nShift timings: 12:30 pm to 9:30 pm IST (i.e., 8:00 am to 5 pm BST)\nOffice-based role\n\nSalary:\nNegotiable, experience dependant\n\nWe love to work with ambitious and proactive people that possess a can-do attitude, without fear of taking risks and who are confident decision-makers. So, if this sounds like you, take this opportunity and apply to join the International Laundryheap Team today!",
    "jobDetails": "Full-time",
    "qualifications": [
      "Google Suite",
      "Communication skills",
      "Office experience",
      "Microsoft Excel",
      "Interviewing"
    ],
    "benefits": [],
    "contact": ""
  },
  {
    "jobTitle": "Customer Relationship Manager – Front End",
    "providingCompany": "The Grand Group - Gurgaon, Haryana",
    "jobDescription": "Full Time\nGurgaon\nPosted 1 month ago\n\nA Client Of The Grand Placements\n\nFemale – Customer Relationship Manager\n\nLocation – Gurgaon\n\nOpening for Ultra-Luxury Real Estate\n\n8 to 15 years of experience in Front Office / Guest Relations with Luxury 5* Hotels ONLY.\n\nSalary range – 15 to 20 Lacs per annum\n\nJob Description: Front End CRM for Real Estate Company (Luxury Residential Project) – Female Candidates Only\n\nWe are seeking a talented female individual with a front office hotel background to join our real estate company as a Front End CRM (Customer Relationship Management) professional for our luxury residential project. As the front-facing representative of our company, you will play a crucial role in providing exceptional customer service and building strong relationships with our esteemed clients.\n\nResponsibilities:\nCustomer Relationship Management: Act as the primary point of contact for potential buyers and existing clients, managing their inquiries, requests, and concerns. Develop and maintain strong relationships to enhance customer satisfaction and loyalty.\nSales Support: Collaborate with the sales team to provide accurate and up-to-date information about the luxury residential project. Assist in lead generation, lead management, and follow-up activities to ensure a seamless customer journey.\nProperty Tours: Coordinate and conduct property tours for prospective buyers, showcasing the features, amenities, and unique selling points of the luxury residential project. Provide detailed explanations and answer questions to facilitate informed decision-making.\nCommunication and Correspondence: Respond to customer inquiries promptly via various communication channels, including email, phone calls, and social media. Prepare and send regular project updates, newsletters, and other relevant communication materials to clients.\nDatabase Management: Maintain accurate and up-to-date customer records in the CRM system, ensuring all interactions, preferences, and requirements are properly documented. Generate reports and analytics to support decision-making and identify areas for improvement.\nEvents and Promotions: Assist in the planning, organization, and execution of events, such as property launches, open houses, and promotional activities. Coordinate with internal teams and external vendors to ensure successful events and maximize client engagement.\nProblem Resolution: Address and resolve customer complaints, issues, and conflicts in a professional and timely manner. Collaborate with the necessary departments to ensure satisfactory resolutions and maintain a positive customer experience.\nMarket Research: Stay updated on the local real estate market trends, competitors, and industry developments. Conduct research and analysis to identify potential target markets, buyer preferences, and emerging opportunities.\n\nRequirements:\nPrevious Front Office Hotel Experience: A solid background in front office operations within the hospitality industry, preferably in luxury hotels or resorts, with a focus on delivering exceptional customer service.\nExcellent Communication Skills: Exceptional verbal and written communication skills, with the ability to effectively engage and interact with a diverse range of clients. Proficiency in multiple languages is a plus.\nCustomer-Focused Mindset: Strong customer service orientation, with a genuine passion for exceeding customer expectations and building long-term relationships. Ability to empathize, listen actively, and provide personalized solutions.\nSales Acumen: Basic understanding of sales principles and processes, with the ability to support the sales team in lead generation and management. Experience in real estate sales or a willingness to learn the industry is preferred.\nTech-Savviness: Proficiency in using CRM software, Microsoft Office Suite, and other relevant tools for data entry, reporting, and communication purposes. Comfortable adapting to new software and technology platforms.\nOrganizational Skills: Excellent multitasking and organizational abilities to manage multiple client interactions, events, and administrative tasks simultaneously. Attention to detail and a proactive approach to problem-solving.\nProfessionalism and Integrity: Demonstrated professionalism, integrity, and ethical behavior in dealing with clients and confidential information. Ability to maintain composure in high-pressure situations and uphold the company’s reputation.\n\nIf you are a customer-focused female individual with a background in front office hotel operations and a passion for the real estate industry, we invite you to apply for this exciting role. Join our team and contribute to the success of our luxury residential project by delivering exceptional customer experiences and building lasting relationships with our valued clients\n\nInterested candidate may send their CV at info@hrprovider.com\n\nOnly short listed candidates will be contacted\n\nTo apply for this job email your details to info@hrprovider.com",
    "jobDetails": "Full-time",
    "qualifications": [
      "CRM software",
      "Market research",
      "Lead generation",
      "Communication skills",
      "Hospitality"
    ],
    "benefits": [],
    "contact": ""
  },
  {
    "jobTitle": "Recruitment Executive",
    "providingCompany": "Smiles.ai - Bengaluru, Karnataka",
    "jobDescription": "About Dezy (Smiles.ai)Dezy is a rapidly growing dental health-tech company with an impeccable online presence. Dezy (Smiles.ai), A startup founded by IIT/IIM alumni in 2019, has acquired $23 million in Series A funding led by Falcon Edge-managed Alpha Wave Ventures. Smiles.ai is poised to take the dental care industry to the next level, thanks to strong engagement from our current Partners, Sequoia Capital India and Chiratae Ventures.We are providing an incredible opportunity for a pleasant, detail-oriented, technically savvy Inside Sales Specialist to join a high-growth start-up and help build a company from the ground up. For someone wishing to accelerate their career growth considerably ahead of the conventional curve, this role guarantees significant leadership and resume-building in a short period of time.Our Mission: We want to build India & GCC’s largest and most-trusted Dental Care Brand. We are a technology company at heart that has developed several key innovations that help consumers with a Free & Fair diagnosis at the comfort of their home, usually just using their smartphone; this solves for the biggest consumer issues on pre-purchase clarity on pricing, quality and expected results. Our proprietary tech and systems enable us to deliver high quality services at honest prices by leveraging several operating efficiencies and process enhancements.Our Team and Culture: We are building an extremely flat knowledge-driven organization with no hierarchy and very high ownership. We stand for approachability and credibility to our consumers, and we want the same values to reflect internally in our org culture as well. If problem-solving, building solutions from scratch, scaling them across geographies excite you - you are welcome atsmiles.ai. We look for high positive energy, clarity of thought, and a great work ethic as the primary parameters, if you bring in specific vertical expertise or relevant experience in tech, sector, business ops, or growth that is an obvious enabler too.Specialties Invisible Smile Aligners, Dental Implants, Smile Makeover, Root Canal, Teeth Whitening, Dental Veneers, Digital Consultation, and At Home ServicesIndustry: Health, Wellness & FitnessJob Description:We are looking for a potential TA specialist, who are looking for a high growth, high ownership role filled with an opportunity to learn in fast pace environment. The role involves managing Leadership hiring and Campus hiring and would involve working closely with the top management & other business leaders on their hiring requirements.Designation: Executive / Sr. Executive – Talent AcquisitionExperience: 1+ years of work experience in Talent Acquisition, preferably Healthcare (dentistry) sectorQualification: Bachelor’s / Masters in Human Resources ManagementRoles and Responsibilities:Coordinate with hiring managers to identify staffing needsWork cross functionally and foster strong consultative relations with key stakeholdersLead the efforts in closing leadership mandates across business functionsEnsures the team implements the Recruitment Plan as per the Annual Operating PlanDetermine selection criteriaSource potential candidates through online channels (e.g. social platforms, job portals, and professional networks), Internal Job Postings, Employee Referrals, Recruitment Database, Job fairs, Campus interviews etc and evaluating Function/Region Transfer optionsPlan interview and selection procedures, including screening calls, assessments and in-person interviewsCreate a pool of talent in pipeline by leveraging social media to attract passive candidatesEnsures that the Job Requisition Forms are completed for all positions sourced – New/ReplacementsAssess candidate information, including resumes and contact details, using our Applicant Tracking SystemLiaison with the HR Operations/Administration/IT/Learning & Development Team to ensure they are kept informed of all new hires and joining dates and respective inputsDesign job descriptions and interview questions that reflect each position’s requirementsConduct competency based interviews either through VC/Telephone/In-Person interactionsLead employer branding initiativesOrganize and attend job fairs and recruitment eventsLead Campus strategy (Tier 1 / Tier 2 colleges)Forecast quarterly and annual hiring needs by departmentFoster long-term relationships with past applicants and potential candidatesTake ownership of candidate experience by designing and managing itRequirements and skills:Proven work experience as a Talent Acquisition Specialist or similar roleAt least 2+ years of strong experience in Leadership hiringHealthcare industry knowledge would be an added advantageExperience in Hiring for dental positions would be preferredShould be well versed and have handled Tech Hiring’s in the pastExperience in Bulk Hiring for Sales & Operations profiles would be preferredRecruitment tracker managementAbility to work in a Fast-paced environment and consistently meet hiring deadlinesEnsure the formulation and implementation of a cost effective Recruitment PlanStrong understanding of the Indian Start-ups and Talent availabilityFamiliarity with social media, resume databases and professional networks (e.g. Naukri, Indeed, LinkedIn etc)Hands-on experience with full-cycle recruiting using various interview techniques and evaluation methodsKnowledge of Applicant Tracking Systems (ATSs)Excellent verbal and written communication skillsA keen understanding of the differences between various roles within organizationsA zeal to learn & growJob Type: Full-timeSalary: ₹300,000.00 - ₹450,000.00 per yearSchedule:Day shiftAbility to commute/relocate:Bengaluru - 560102, Karnataka: Reliably commute or planning to relocate before starting work (Required)Experience:Recruiting: 2 years (Required)total work: 2 years (Preferred)",
    "jobDetails": "Full-time5 days ago",
    "qualifications": [
      "Communication skills",
      "Recruiting",
      "ATS",
      "Databases",
      "Talent acquisition",
      "Bachelor's degree",
      "Master's degree"
    ],
    "benefits": [],
    "contact": ""
  }
]